// 1. B 라는 이름의 클래스작성
public class B {
// 1-1. B 클래스안에 멤버변수 2개선언(정의): 이름 x,y
	int x;
	double y;
// 1-2. B 클래스안에 멤버메쏘드 m1,m2 2개선언(정의)	
	public void m1() {
		System.out.println("m1 호출");
	}
	
	public void m2() {
		System.out.println("m2 호출");
	}
	
	/*
	 * 메소드는 객체의 동작에 해당되는 중괄호{ } 블록이다.
	 * 리턴타입 메소드이름 ([매개변수선언, ] { 메소드 실행 블록 }
	 * 리턴타입 : 메소드가 리턴하는 결과의 타입 표시
	 * 메소드 이름 : 메소드의 기능이 드러나도록 식별자 규칙에 맞게 이름 지어주기
	 * 매개 변수 선언 : 메소드를 실행할 때 필요한 데이터를 받기 위한 변수를 선언
	 * 메소드 실행 블록 : 실행할 코드를 작성
	 */
	
}
